# yolov5fpn.yaml
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
# anchors: 4      # auto-anchors
anchors:  # custom anchors
  - [5, 7, 10, 13, 16, 20]  # P2/4
  - [57.5, 42.0, 46.99, 36.0, 23.99, 17.5] # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [152, 110, 165, 115, 181, 120] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  [
    [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 FPN head
head: [
    [-1, 3, C3, [1024, False]],  # 10 (P5/32-large)
    
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 3, C3, [512, False]],  # 14 (P4/16-medium)
    
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]],  # cat backbone P3
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 3, C3, [256, False]],  # 18 (P3/8-small)

    # Add a new layer for P2/4 detection
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 2], 1, Concat, [1]],  # cat backbone P2
    [-1, 1, Conv, [128, 1, 1]],
    [-1, 3, C3, [128, False]],  # 22 P2/4-small
    
    # [[18, 14, 10], 1, Detect, [nc, anchors, [128, 256, 512, 1024]]],  # Detect(P3, P4, P5)
    [[22, 18, 14, 10], 1, Detect, [nc, anchors, [128, 256, 512, 1024]]]  # Detect(P2, P3, P4, P5)
]
